atc1441/ESP32_nRF52_SWD/ESP32_SWD_WIFI/web.cpp
                  if (nrf_ufcr.flash_size > (SPIFFS.totalBytes() - SPIFFS.usedBytes()))
                  {
                    request->send(200, "text/plain", "Not enough free space on the ESP32");
                    return;
                  }

                  String filename = "/full_flash.bin";
                  set_read_flash(0, nrf_ufcr.flash_size, filename);

                  request->send(200, "text/plain", "Ok create task full dump");
                }
                else if (new_state == "dump_full_uicr")
                {

                  if (get_glitcher())
                  {
                    request->send(200, "text/plain", "ERROR Glitcher is running");
                    return;
                  }
                  if (is_nrf_connected() == 0)
                  {
                    request->send(200, "text/plain", "ERROR nRF not connected");
                    return;
                  }
                  else if (is_nrf_connected() == 1)
                  {
                    request->send(200, "text/plain", "ERROR nRF is locked");
                    return;
                  }

                  if (0x1000 > (SPIFFS.totalBytes() - SPIFFS.usedBytes()))
                  {
                    request->send(200, "text/plain", "Not enough free space on the ESP32");
                    return;
                  }
                  String filename = "/full_uicr.bin";
                  set_read_flash(0x10001000, 0x1000, filename);

                  request->send(200, "text/plain", "Ok create UICR dump");
                }
                return;
              }
              request->send(200, "text/plain", "Wrong parameter");
            });

  server.on(
      "/flash_file_direct", HTTP_POST, [](AsyncWebServerRequest *request)
      { request->send(200, "text/plain", "Upload complete!"); },
      [](AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final)
      {
        static LoopbackStream buffer(512);
        static uint32_t flash_offset;
        static uint32_t written_bytes;
        static long millis_start;
        static int file_type;
        static bool upload_failed;

        size_t pos = 0;

        Serial.printf("received data file:%s index:%d len:%d final:%d\r\n", filename.c_str(), index, len, final);

        if (!index)
        {
          millis_start = millis();
          written_bytes = 0;
          upload_failed = false;
          buffer.clear();

          if (request->hasParam("flash_up_file_offset"), true)
          {
            flash_offset = hstol(request->getParam("flash_up_file_offset", true)->value());
          } else {
            flash_offset = 0;
          }

          if (filename.endsWith(".hex")){
            file_type = 2;
            flash_offset = 0; //we ignore offset for hex files
          } else {
            file_type = 1;
          }
        }

        if (upload_failed){
          return;
        }

        while (pos < len) {
          buffer.write(data[pos++]);

          if (file_type == 1){
            int chunk_size = 256;
            if ((pos == len) && (final)){
              chunk_size = buffer.available();
            }

            if (buffer.available() >= chunk_size){
              char buf[chunk_size];
              buffer.readBytes(buf, chunk_size);

              Serial.printf("Ok gonna flash bank final: %i, offset:%08x, len: %i len_callback %i\r\n", final, flash_offset + written_bytes, chunk_size, len);
              nrf_write_bank(flash_offset + written_bytes, (uint32_t *)buf, chunk_size);
              written_bytes += chunk_size;
            }
          } else if (file_type == 2){
              if (buffer.contains('\n')){
                String line = buffer.readStringUntil('\n');
                Serial.printf("hex line found: \r\n"); Serial.print(line); Serial.printf("\r\n");

                if (line[0] != ':'){
                  Serial.printf("ERROR: line not starting with ':'\r\n");
                  upload_failed = true;
                  return;
                }
                int data_len = nibble(line[1])*16 + nibble(line[2]);
                int line_len = data_len + 5;
                byte buf[line_len];
                if (int ret = decode_line(buf, line)) {
                  Serial.printf("ERROR: line decode error %d\r\n", ret);
                  upload_failed = true;
                  return;
                }

                if (buf[3] == 0x02){
                  flash_offset = buf[4]*0x1000 + buf[5]*0x10;
                  Serial.printf("Setting flash_offset to %d\r\n", flash_offset);
                } else if (buf[3] == 0x04){
                  flash_offset = (flash_offset & 0xFFFF) + (buf[4] << 24) + (buf[5] << 16);
                  Serial.printf("Setting flash_offset to %d\r\n", flash_offset);
                } else if (buf[3] == 0x00){
                  int off = buf[1]*0x100 + buf[2];
                  Serial.printf("Writing flash_offset: 0x%x off 0x%x\r\n", flash_offset, off);
                  nrf_write_bank(flash_offset + off, (uint32_t *)(buf+4), buf[0]);
                  written_bytes += buf[0];
                }

              }
          }

        }

        if (final)
        {
          set_last_speed((float)((float)(written_bytes) / (float)(millis() - millis_start)));
        }
      });

  server.on("/download_flash", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              nrf_info_struct nrf_ufcr;
              get_new_main_info(&nrf_ufcr);
              int download_len = nrf_ufcr.flash_size;

              static uint32_t offset = 0;

              if (request->hasParam("offset"))
              {
                offset = hstol(request->getParam("offset")->value());

                if (offset > nrf_ufcr.flash_size)
                {
                  request->send(400, "text/html", "ERROR: Invalid offset!");
                  return;
                }
              }

              if (request->hasParam("len"))
              {
                download_len = hstol(request->getParam("len")->value());
                if (offset + download_len > nrf_ufcr.flash_size)
                {
                  request->send(400, "text/html", "ERROR: Too big download length!");
                  return;
                }
              }

              if (offset + download_len > nrf_ufcr.flash_size)
              {
                download_len = nrf_ufcr.flash_size - offset;
              }

