atc1441/ESP32_nRF52_SWD/ESP32_SWD_WIFI/web.cpp
              Serial.printf("reading flash: offset:0x%X download_len:%d\n", offset, download_len);

              AsyncWebServerResponse *response = request->beginResponse("application/octet-stream", download_len, [](uint8_t *buffer, size_t maxLen, size_t index) -> size_t
                                                                        {
                                                                          Serial.printf("handle download: index:0x%X maxLen:%d offset:0x%X\n", index, maxLen, offset);

                                                                          if (maxLen > 0)
                                                                          {
                                                                            return nrf_read_bank_bytes(offset + index, buffer, maxLen);
                                                                          }

                                                                          return 0;
                                                                        });

              response->addHeader("Content-Disposition", "attachment; filename=\"flash.bin\"");
              request->send(response);
            });

  server.on("/get_graph", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              if (request->hasParam("size") && request->hasParam("delay"))
              {
                uint32_t size = request->getParam("size")->value().toInt();
                uint32_t delay_time = request->getParam("delay")->value().toInt();
                uint16_t graph_buff[size] = {0};
                get_osci_graph(graph_buff, size, delay_time);
                String answer_state = "";
                for (int i = 0; i < size; i++)
                {
                  answer_state += String(graph_buff[i]) + ",";
                }
                answer_state += "0";
                request->send(200, "text/plain", answer_state);
              }
            });

  server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.htm");

  server.onNotFound([](AsyncWebServerRequest *request)
                    {
                      if (request->url() == "/" || request->url() == "index.htm")
                      { // not uploaded the index.htm till now so notify the user about it
                        request->send(200, "text/html", "please use <a href=\"/edit\">/edit</a> with login defined in web.cpp to upload the supplied index.htm to get full useage");
                        return;
                      }
                      Serial.printf("NOT_FOUND: ");
                      if (request->method() == HTTP_GET)
                        Serial.printf("GET");
                      else if (request->method() == HTTP_POST)
                        Serial.printf("POST");
                      else if (request->method() == HTTP_DELETE)
                        Serial.printf("DELETE");
                      else if (request->method() == HTTP_PUT)
                        Serial.printf("PUT");
                      else if (request->method() == HTTP_PATCH)
                        Serial.printf("PATCH");
                      else if (request->method() == HTTP_HEAD)
                        Serial.printf("HEAD");
                      else if (request->method() == HTTP_OPTIONS)
                        Serial.printf("OPTIONS");
                      else
                        Serial.printf("UNKNOWN");
                      Serial.printf(" http://%s%s\n", request->host().c_str(), request->url().c_str());

                      if (request->contentLength())
                      {
                        Serial.printf("_CONTENT_TYPE: %s\n", request->contentType().c_str());
                        Serial.printf("_CONTENT_LENGTH: %u\n", request->contentLength());
                      }
                      int headers = request->headers();
                      int i;
                      for (i = 0; i < headers; i++)
                      {
                        const AsyncWebHeader *h = request->getHeader(i);
                        Serial.printf("_HEADER[%s]: %s\n", h->name().c_str(), h->value().c_str());
                      }
                      int params = request->params();
                      for (i = 0; i < params; i++)
                      {
                        const AsyncWebParameter *p = request->getParam(i);
                        if (p->isFile())
                        {
                          Serial.printf("_FILE[%s]: %s, size: %u\n", p->name().c_str(), p->value().c_str(), p->size());
                        }
                        else if (p->isPost())
                        {
                          Serial.printf("_POST[%s]: %s\n", p->name().c_str(), p->value().c_str());
                        }
                        else
                        {
                          Serial.printf("_GET[%s]: %s\n", p->name().c_str(), p->value().c_str());
                        }
                      }
                      request->send(404);
                    });

  server.begin();
}
